ext-sources-app/tests/test_files/soap/MCP_testSearch_county_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.services.screening.medicaid.gov/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:search>
         <arg0>
            <criteria>County</criteria>
            <value>57</value>
            <type>All Provider Types</type>
         </arg0>
      </impl:search>
   </soapenv:Body>
</soapenv:Envelope>